# text = [1, 2, 4, 5, 1, 5, 3, 10]

# print(text)
# new_text = [x for x in text if text.count(x) == 1]
# print(new_text)


# 1. Напишите программу вычисления арифметического выражения заданного строкой. Используйте операции +,-,/,*. приоритет операций стандартный. 
#     *Пример:*  
#     2+2 => 4;   
#     1+2*3 => 7;   
#     1-2*3 => -5;

